meeting/agenda/2026/06-02.org
:PROPERTIES:
:ID:       8A596760-5E11-416F-A54A-ABE5D9C7FB8E
:END:
#+title: QT4 CG Meeting 167 Agenda 2026-06-02/03
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be held in Prague, colocated with the XML Prague conference.
We will meet in room NB 468 in Nová Budova/New Building on 4th floor starting at
10:00am on Tuesday, 2 June 2026. We will meet again in the same room on
Wednesday also starting at 10:00am.

This is the same room where we met last time. It is the same build where main
auditorium for the conference is located. Just take elevator to the 4th floor
and then look for rooms in the corridor on the right side.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** End of day wrap up
:PROPERTIES:
:CUSTOM_ID: h-C251C974-734C-468E-9394-174EC8F89DFF
:END:

At the end of each day, we’ll attempt to setup a Zoom call using the usual
coordinates for folks who aren’t able to attend but would like a summary of what
has been discussed.

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: h-F4A8056A-6FAB-4377-9B37-1769056DAD0A
:END:

** Review of open issues
:PROPERTIES:
:CUSTOM_ID: h-1B8EBC0B-657D-490B-AD97-45A645C05A6D
:END:

We’ll review the current open issues and attempt to resolve as many as
practical. We need to be more assertive about closing issues where there is no
clear path to completion.

** JSON transformations
:PROPERTIES:
:CUSTOM_ID: h-A579CC14-F1FF-4663-89A2-2BFF9CE2879E
:END:

Group workshopping on approaches to JSON transformations. What works, what
doesn’t, what’s missing?

** Trusted execution
:PROPERTIES:
:CUSTOM_ID: h-50E837B0-55F5-4EC0-810C-B142D5405D16
:END:

Group workshopping on the trusted execution model. Is it complete and
sufficient? What’s missing?

** Publication scheduling
:PROPERTIES:
:CUSTOM_ID: h-A4EF6BD0-A336-48F3-B8E0-ED8ECE058D94
:END:

What are we going to publish, and when? How do we inform the broader community
when we think we’re ready for “last call” review? How do we manage the details
of final publication?


* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
