meeting/agenda/2026/06-02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 167 Agenda 2026-06-02/03</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 167 Agenda 2026-06-02/03</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be held in Prague, colocated with the XML Prague conference.
We will meet in room NB 468 in Nová Budova/New Building on 4th floor starting at
10:00am on Tuesday, 2 June 2026. We will meet again in the same room on
Wednesday also starting at 10:00am.
</p>

<p>
This is the same room where we met last time. It is the same build where main
auditorium for the conference is located. Just take elevator to the 4th floor
and then look for rooms in the corridor on the right side.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-h-C251C974-734C-468E-9394-174EC8F89DFF" class="outline-3">
<h3 id="h-C251C974-734C-468E-9394-174EC8F89DFF"><span class="section-number-3">1.3.</span> End of day wrap up</h3>
<div class="outline-text-3" id="text-h-C251C974-734C-468E-9394-174EC8F89DFF">
<p>
At the end of each day, we’ll attempt to setup a Zoom call using the usual
coordinates for folks who aren’t able to attend but would like a summary of what
has been discussed.
</p>
</div>
</div>
</div>
<div id="outline-container-h-F4A8056A-6FAB-4377-9B37-1769056DAD0A" class="outline-2">
<h2 id="h-F4A8056A-6FAB-4377-9B37-1769056DAD0A"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-h-F4A8056A-6FAB-4377-9B37-1769056DAD0A">
</div>
<div id="outline-container-h-1B8EBC0B-657D-490B-AD97-45A645C05A6D" class="outline-3">
<h3 id="h-1B8EBC0B-657D-490B-AD97-45A645C05A6D"><span class="section-number-3">2.1.</span> Review of open issues</h3>
<div class="outline-text-3" id="text-h-1B8EBC0B-657D-490B-AD97-45A645C05A6D">
<p>
We’ll review the current open issues and attempt to resolve as many as
practical. We need to be more assertive about closing issues where there is no
clear path to completion.
</p>
</div>
</div>
<div id="outline-container-h-A579CC14-F1FF-4663-89A2-2BFF9CE2879E" class="outline-3">
<h3 id="h-A579CC14-F1FF-4663-89A2-2BFF9CE2879E"><span class="section-number-3">2.2.</span> JSON transformations</h3>
<div class="outline-text-3" id="text-h-A579CC14-F1FF-4663-89A2-2BFF9CE2879E">
<p>
Group workshopping on approaches to JSON transformations. What works, what
doesn’t, what’s missing?
</p>
</div>
</div>
<div id="outline-container-h-50E837B0-55F5-4EC0-810C-B142D5405D16" class="outline-3">
<h3 id="h-50E837B0-55F5-4EC0-810C-B142D5405D16"><span class="section-number-3">2.3.</span> Trusted execution</h3>
<div class="outline-text-3" id="text-h-50E837B0-55F5-4EC0-810C-B142D5405D16">
<p>
Group workshopping on the trusted execution model. Is it complete and
sufficient? What’s missing?
</p>
</div>
</div>
<div id="outline-container-h-A4EF6BD0-A336-48F3-B8E0-ED8ECE058D94" class="outline-3">
<h3 id="h-A4EF6BD0-A336-48F3-B8E0-ED8ECE058D94"><span class="section-number-3">2.4.</span> Publication scheduling</h3>
<div class="outline-text-3" id="text-h-A4EF6BD0-A336-48F3-B8E0-ED8ECE058D94">
<p>
What are we going to publish, and when? How do we inform the broader community
when we think we’re ready for “last call” review? How do we manage the details
of final publication?
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
